{
    "weightsManifest": [{
        "paths": ["group1-shard1of1"],
        "weights": [{
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_14/gamma"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_14/beta"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_14/moving_mean"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_14/moving_variance"
        }]
    }, {
        "paths": ["group2-shard1of1"],
        "weights": [{
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_15/gamma"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_15/beta"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_15/moving_mean"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_15/moving_variance"
        }]
    }, {
        "paths": ["group3-shard1of1"],
        "weights": [{
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_16/gamma"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_16/beta"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_16/moving_mean"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "batch_normalization_16/moving_variance"
        }]
    }, {
        "paths": ["group4-shard1of1"],
        "weights": [{
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_17/gamma"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_17/beta"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_17/moving_mean"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_17/moving_variance"
        }]
    }, {
        "paths": ["group5-shard1of1"],
        "weights": [{
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_18/gamma"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_18/beta"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_18/moving_mean"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "batch_normalization_18/moving_variance"
        }]
    }, {
        "paths": ["group6-shard1of1"],
        "weights": [{
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_19/gamma"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_19/beta"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_19/moving_mean"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_19/moving_variance"
        }]
    }, {
        "paths": ["group7-shard1of1"],
        "weights": [{
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_20/gamma"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_20/beta"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_20/moving_mean"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "batch_normalization_20/moving_variance"
        }]
    }, {
        "paths": ["group8-shard1of1"],
        "weights": [{
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_21/gamma"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_21/beta"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_21/moving_mean"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_21/moving_variance"
        }]
    }, {
        "paths": ["group9-shard1of1"],
        "weights": [{
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_22/gamma"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_22/beta"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_22/moving_mean"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "batch_normalization_22/moving_variance"
        }]
    }, {
        "paths": ["group10-shard1of1"],
        "weights": [{
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_23/gamma"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_23/beta"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_23/moving_mean"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_23/moving_variance"
        }]
    }, {
        "paths": ["group11-shard1of1"],
        "weights": [{
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_24/gamma"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_24/beta"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_24/moving_mean"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "batch_normalization_24/moving_variance"
        }]
    }, {
        "paths": ["group12-shard1of1"],
        "weights": [{
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_25/gamma"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_25/beta"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_25/moving_mean"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_25/moving_variance"
        }]
    }, {
        "paths": ["group13-shard1of1"],
        "weights": [{
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_26/gamma"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_26/beta"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_26/moving_mean"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "batch_normalization_26/moving_variance"
        }]
    }, {
        "paths": ["group14-shard1of10", "group14-shard2of10", "group14-shard3of10", "group14-shard4of10", "group14-shard5of10", "group14-shard6of10", "group14-shard7of10", "group14-shard8of10", "group14-shard9of10", "group14-shard10of10"],
        "weights": [{
            "shape": [3, 3, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_20/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_20/bias"
        }]
    }, {
        "paths": ["group15-shard1of10", "group15-shard2of10", "group15-shard3of10", "group15-shard4of10", "group15-shard5of10", "group15-shard6of10", "group15-shard7of10", "group15-shard8of10", "group15-shard9of10", "group15-shard10of10"],
        "weights": [{
            "shape": [3, 3, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_21/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_21/bias"
        }]
    }, {
        "paths": ["group16-shard1of10", "group16-shard2of10", "group16-shard3of10", "group16-shard4of10", "group16-shard5of10", "group16-shard6of10", "group16-shard7of10", "group16-shard8of10", "group16-shard9of10", "group16-shard10of10"],
        "weights": [{
            "shape": [3, 3, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_22/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_22/bias"
        }]
    }, {
        "paths": ["group17-shard1of5", "group17-shard2of5", "group17-shard3of5", "group17-shard4of5", "group17-shard5of5"],
        "weights": [{
            "shape": [3, 3, 1024, 512],
            "dtype": "float32",
            "name": "conv2d_23/kernel"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "conv2d_23/bias"
        }]
    }, {
        "paths": ["group18-shard1of3", "group18-shard2of3", "group18-shard3of3"],
        "weights": [{
            "shape": [3, 3, 512, 512],
            "dtype": "float32",
            "name": "conv2d_24/kernel"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "conv2d_24/bias"
        }]
    }, {
        "paths": ["group19-shard1of5", "group19-shard2of5", "group19-shard3of5", "group19-shard4of5", "group19-shard5of5"],
        "weights": [{
            "shape": [3, 3, 1024, 512],
            "dtype": "float32",
            "name": "conv2d_25/kernel"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "conv2d_25/bias"
        }]
    }, {
        "paths": ["group20-shard1of2", "group20-shard2of2"],
        "weights": [{
            "shape": [3, 3, 512, 256],
            "dtype": "float32",
            "name": "conv2d_26/kernel"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "conv2d_26/bias"
        }]
    }, {
        "paths": ["group21-shard1of1"],
        "weights": [{
            "shape": [3, 3, 256, 256],
            "dtype": "float32",
            "name": "conv2d_27/kernel"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "conv2d_27/bias"
        }]
    }, {
        "paths": ["group22-shard1of2", "group22-shard2of2"],
        "weights": [{
            "shape": [3, 3, 512, 256],
            "dtype": "float32",
            "name": "conv2d_28/kernel"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "conv2d_28/bias"
        }]
    }, {
        "paths": ["group23-shard1of1"],
        "weights": [{
            "shape": [3, 3, 256, 128],
            "dtype": "float32",
            "name": "conv2d_29/kernel"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "conv2d_29/bias"
        }]
    }, {
        "paths": ["group24-shard1of1"],
        "weights": [{
            "shape": [3, 3, 128, 128],
            "dtype": "float32",
            "name": "conv2d_30/kernel"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "conv2d_30/bias"
        }]
    }, {
        "paths": ["group25-shard1of1"],
        "weights": [{
            "shape": [3, 3, 256, 128],
            "dtype": "float32",
            "name": "conv2d_31/kernel"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "conv2d_31/bias"
        }]
    }, {
        "paths": ["group26-shard1of1"],
        "weights": [{
            "shape": [3, 3, 128, 64],
            "dtype": "float32",
            "name": "conv2d_32/kernel"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "conv2d_32/bias"
        }]
    }, {
        "paths": ["group27-shard1of1"],
        "weights": [{
            "shape": [3, 3, 64, 64],
            "dtype": "float32",
            "name": "conv2d_33/kernel"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "conv2d_33/bias"
        }]
    }, {
        "paths": ["group28-shard1of1"],
        "weights": [{
            "shape": [3, 3, 128, 64],
            "dtype": "float32",
            "name": "conv2d_34/kernel"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "conv2d_34/bias"
        }]
    }, {
        "paths": ["group29-shard1of1"],
        "weights": [{
            "shape": [3, 3, 64, 32],
            "dtype": "float32",
            "name": "conv2d_35/kernel"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "conv2d_35/bias"
        }]
    }, {
        "paths": ["group30-shard1of1"],
        "weights": [{
            "shape": [3, 3, 32, 32],
            "dtype": "float32",
            "name": "conv2d_36/kernel"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "conv2d_36/bias"
        }]
    }, {
        "paths": ["group31-shard1of1"],
        "weights": [{
            "shape": [3, 3, 64, 32],
            "dtype": "float32",
            "name": "conv2d_37/kernel"
        }, {
            "shape": [32],
            "dtype": "float32",
            "name": "conv2d_37/bias"
        }]
    }, {
        "paths": ["group32-shard1of1"],
        "weights": [{
            "shape": [3, 3, 32, 3],
            "dtype": "float32",
            "name": "conv2d_38/kernel"
        }, {
            "shape": [3],
            "dtype": "float32",
            "name": "conv2d_38/bias"
        }]
    }, {
        "paths": ["group33-shard1of5", "group33-shard2of5", "group33-shard3of5", "group33-shard4of5", "group33-shard5of5"],
        "weights": [{
            "shape": [2, 2, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_transpose_13/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_transpose_13/bias"
        }]
    }, {
        "paths": ["group34-shard1of5", "group34-shard2of5", "group34-shard3of5", "group34-shard4of5", "group34-shard5of5"],
        "weights": [{
            "shape": [2, 2, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_transpose_14/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_transpose_14/bias"
        }]
    }, {
        "paths": ["group35-shard1of5", "group35-shard2of5", "group35-shard3of5", "group35-shard4of5", "group35-shard5of5"],
        "weights": [{
            "shape": [2, 2, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_transpose_15/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_transpose_15/bias"
        }]
    }, {
        "paths": ["group36-shard1of5", "group36-shard2of5", "group36-shard3of5", "group36-shard4of5", "group36-shard5of5"],
        "weights": [{
            "shape": [2, 2, 1024, 1024],
            "dtype": "float32",
            "name": "conv2d_transpose_16/kernel"
        }, {
            "shape": [1024],
            "dtype": "float32",
            "name": "conv2d_transpose_16/bias"
        }]
    }, {
        "paths": ["group37-shard1of2", "group37-shard2of2"],
        "weights": [{
            "shape": [2, 2, 512, 512],
            "dtype": "float32",
            "name": "conv2d_transpose_17/kernel"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "conv2d_transpose_17/bias"
        }]
    }, {
        "paths": ["group38-shard1of2", "group38-shard2of2"],
        "weights": [{
            "shape": [2, 2, 512, 512],
            "dtype": "float32",
            "name": "conv2d_transpose_18/kernel"
        }, {
            "shape": [512],
            "dtype": "float32",
            "name": "conv2d_transpose_18/bias"
        }]
    }, {
        "paths": ["group39-shard1of1"],
        "weights": [{
            "shape": [2, 2, 256, 256],
            "dtype": "float32",
            "name": "conv2d_transpose_19/kernel"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "conv2d_transpose_19/bias"
        }]
    }, {
        "paths": ["group40-shard1of1"],
        "weights": [{
            "shape": [2, 2, 256, 256],
            "dtype": "float32",
            "name": "conv2d_transpose_20/kernel"
        }, {
            "shape": [256],
            "dtype": "float32",
            "name": "conv2d_transpose_20/bias"
        }]
    }, {
        "paths": ["group41-shard1of1"],
        "weights": [{
            "shape": [2, 2, 128, 128],
            "dtype": "float32",
            "name": "conv2d_transpose_21/kernel"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "conv2d_transpose_21/bias"
        }]
    }, {
        "paths": ["group42-shard1of1"],
        "weights": [{
            "shape": [2, 2, 128, 128],
            "dtype": "float32",
            "name": "conv2d_transpose_22/kernel"
        }, {
            "shape": [128],
            "dtype": "float32",
            "name": "conv2d_transpose_22/bias"
        }]
    }, {
        "paths": ["group43-shard1of1"],
        "weights": [{
            "shape": [2, 2, 64, 64],
            "dtype": "float32",
            "name": "conv2d_transpose_23/kernel"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "conv2d_transpose_23/bias"
        }]
    }, {
        "paths": ["group44-shard1of1"],
        "weights": [{
            "shape": [2, 2, 64, 64],
            "dtype": "float32",
            "name": "conv2d_transpose_24/kernel"
        }, {
            "shape": [64],
            "dtype": "float32",
            "name": "conv2d_transpose_24/bias"
        }]
    }, {
        "paths": ["group45-shard1of3", "group45-shard2of3", "group45-shard3of3"],
        "weights": [{
            "shape": [128, 16384],
            "dtype": "float32",
            "name": "dense_2/kernel"
        }, {
            "shape": [16384],
            "dtype": "float32",
            "name": "dense_2/bias"
        }]
    }],
    "modelTopology": {
        "keras_version": "2.1.5",
        "model_config": {
            "class_name": "Model",
            "config": {
                "layers": [{
                    "inbound_nodes": [],
                    "config": {
                        "batch_input_shape": [null, 128],
                        "dtype": "float32",
                        "name": "input_2",
                        "sparse": false
                    },
                    "name": "input_2",
                    "class_name": "InputLayer"
                }, {
                    "inbound_nodes": [
                        [
                            ["input_2", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "use_bias": true,
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "dtype": "float32",
                        "name": "dense_2",
                        "kernel_regularizer": null,
                        "units": 16384,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "batch_input_shape": [null, 128],
                        "activation": "linear",
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "trainable": true,
                        "kernel_constraint": null
                    },
                    "name": "dense_2",
                    "class_name": "Dense"
                }, {
                    "inbound_nodes": [
                        [
                            ["dense_2", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "target_shape": [1024, 4, 4],
                        "name": "reshape_2",
                        "trainable": true
                    },
                    "name": "reshape_2",
                    "class_name": "Reshape"
                }, {
                    "inbound_nodes": [
                        [
                            ["reshape_2", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "gamma_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "beta_constraint": null,
                        "epsilon": 0.001,
                        "beta_regularizer": null,
                        "beta_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "moving_mean_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "name": "batch_normalization_14",
                        "axis": 1,
                        "trainable": true,
                        "scale": true,
                        "gamma_regularizer": null,
                        "gamma_constraint": null,
                        "center": true,
                        "moving_variance_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "momentum": 0.99
                    },
                    "name": "batch_normalization_14",
                    "class_name": "BatchNormalization"
                }, {
                    "inbound_nodes": [
                        [
                            ["batch_normalization_14", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "activation": "relu",
                        "name": "activation_15",
                        "trainable": true
                    },
                    "name": "activation_15",
                    "class_name": "Activation"
                }, {
                    "inbound_nodes": [
                        [
                            ["activation_15", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [2, 2],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_transpose_13",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_size": [2, 2],
                        "kernel_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activation": "linear",
                        "kernel_constraint": null
                    },
                    "name": "conv2d_transpose_13",
                    "class_name": "Conv2DTranspose"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_transpose_13", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_20",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_20",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_20", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "gamma_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "beta_constraint": null,
                        "epsilon": 0.001,
                        "beta_regularizer": null,
                        "beta_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "moving_mean_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "name": "batch_normalization_15",
                        "axis": 1,
                        "trainable": true,
                        "scale": true,
                        "gamma_regularizer": null,
                        "gamma_constraint": null,
                        "center": true,
                        "moving_variance_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "momentum": 0.99
                    },
                    "name": "batch_normalization_15",
                    "class_name": "BatchNormalization"
                }, {
                    "inbound_nodes": [
                        [
                            ["batch_normalization_15", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "activation": "relu",
                        "name": "activation_16",
                        "trainable": true
                    },
                    "name": "activation_16",
                    "class_name": "Activation"
                }, {
                    "inbound_nodes": [
                        [
                            ["reshape_2", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [2, 2],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_transpose_14",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_size": [2, 2],
                        "kernel_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activation": "linear",
                        "kernel_constraint": null
                    },
                    "name": "conv2d_transpose_14",
                    "class_name": "Conv2DTranspose"
                }, {
                    "inbound_nodes": [
                        [
                            ["activation_16", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_21",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_21",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_transpose_14", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_22",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_22",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_21", 0, 0, {}],
                            ["conv2d_22", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "name": "add_7",
                        "trainable": true
                    },
                    "name": "add_7",
                    "class_name": "Add"
                }, {
                    "inbound_nodes": [
                        [
                            ["add_7", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "gamma_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "beta_constraint": null,
                        "epsilon": 0.001,
                        "beta_regularizer": null,
                        "beta_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "moving_mean_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "name": "batch_normalization_16",
                        "axis": 1,
                        "trainable": true,
                        "scale": true,
                        "gamma_regularizer": null,
                        "gamma_constraint": null,
                        "center": true,
                        "moving_variance_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "momentum": 0.99
                    },
                    "name": "batch_normalization_16",
                    "class_name": "BatchNormalization"
                }, {
                    "inbound_nodes": [
                        [
                            ["batch_normalization_16", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "activation": "relu",
                        "name": "activation_17",
                        "trainable": true
                    },
                    "name": "activation_17",
                    "class_name": "Activation"
                }, {
                    "inbound_nodes": [
                        [
                            ["activation_17", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [2, 2],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_transpose_15",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_size": [2, 2],
                        "kernel_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activation": "linear",
                        "kernel_constraint": null
                    },
                    "name": "conv2d_transpose_15",
                    "class_name": "Conv2DTranspose"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_transpose_15", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_23",
                        "kernel_regularizer": null,
                        "filters": 512,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_23",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_23", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "gamma_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "beta_constraint": null,
                        "epsilon": 0.001,
                        "beta_regularizer": null,
                        "beta_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "moving_mean_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "name": "batch_normalization_17",
                        "axis": 1,
                        "trainable": true,
                        "scale": true,
                        "gamma_regularizer": null,
                        "gamma_constraint": null,
                        "center": true,
                        "moving_variance_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "momentum": 0.99
                    },
                    "name": "batch_normalization_17",
                    "class_name": "BatchNormalization"
                }, {
                    "inbound_nodes": [
                        [
                            ["batch_normalization_17", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "activation": "relu",
                        "name": "activation_18",
                        "trainable": true
                    },
                    "name": "activation_18",
                    "class_name": "Activation"
                }, {
                    "inbound_nodes": [
                        [
                            ["add_7", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [2, 2],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_transpose_16",
                        "kernel_regularizer": null,
                        "filters": 1024,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_size": [2, 2],
                        "kernel_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activation": "linear",
                        "kernel_constraint": null
                    },
                    "name": "conv2d_transpose_16",
                    "class_name": "Conv2DTranspose"
                }, {
                    "inbound_nodes": [
                        [
                            ["activation_18", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_24",
                        "kernel_regularizer": null,
                        "filters": 512,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_24",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_transpose_16", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_25",
                        "kernel_regularizer": null,
                        "filters": 512,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
                            "class_name": "VarianceScaling"
                        },
                        "dilation_rate": [1, 1],
                        "kernel_constraint": null
                    },
                    "name": "conv2d_25",
                    "class_name": "Conv2D"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_24", 0, 0, {}],
                            ["conv2d_25", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "name": "add_8",
                        "trainable": true
                    },
                    "name": "add_8",
                    "class_name": "Add"
                }, {
                    "inbound_nodes": [
                        [
                            ["add_8", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "gamma_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "beta_constraint": null,
                        "epsilon": 0.001,
                        "beta_regularizer": null,
                        "beta_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "moving_mean_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "name": "batch_normalization_18",
                        "axis": 1,
                        "trainable": true,
                        "scale": true,
                        "gamma_regularizer": null,
                        "gamma_constraint": null,
                        "center": true,
                        "moving_variance_initializer": {
                            "config": {},
                            "class_name": "Ones"
                        },
                        "momentum": 0.99
                    },
                    "name": "batch_normalization_18",
                    "class_name": "BatchNormalization"
                }, {
                    "inbound_nodes": [
                        [
                            ["batch_normalization_18", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "activation": "relu",
                        "name": "activation_19",
                        "trainable": true
                    },
                    "name": "activation_19",
                    "class_name": "Activation"
                }, {
                    "inbound_nodes": [
                        [
                            ["activation_19", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [2, 2],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_transpose_17",
                        "kernel_regularizer": null,
                        "filters": 512,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "kernel_size": [2, 2],
                        "kernel_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activation": "linear",
                        "kernel_constraint": null
                    },
                    "name": "conv2d_transpose_17",
                    "class_name": "Conv2DTranspose"
                }, {
                    "inbound_nodes": [
                        [
                            ["conv2d_transpose_17", 0, 0, {}]
                        ]
                    ],
                    "config": {
                        "data_format": "channels_first",
                        "strides": [1, 1],
                        "use_bias": true,
                        "padding": "same",
                        "bias_initializer": {
                            "config": {},
                            "class_name": "Zeros"
                        },
                        "activity_regularizer": null,
                        "name": "conv2d_26",
                        "kernel_regularizer": null,
                        "filters": 256,
                        "trainable": true,
                        "bias_constraint": null,
                        "bias_regularizer": null,
                        "activation": "linear",
                        "kernel_size": [3, 3],
                        "kernel_initializer": {
                            "config": {
                                "distribution": "uniform",
                                "scale": 1.0,
                                "seed": null,
                                "mode": "fan_avg"
                            },
